/*===================================================================
//ファイル:TransformComponent.h
//制作日:2025/12/06
//概要:基本コンポーネント
//制作者:伊藤駿汰
//-------------------------------------------------------------------
//更新履歴:
//2025/12/06:新規作成
=====================================================================*/
#pragma once
#include <DirectXMath.h>

struct TransformComponent {
	DirectX::XMFLOAT3 position = { 0.0f, 0.0f, 0.0f };
	DirectX::XMFLOAT3 rotation = { 0.0f, 0.0f, 0.0f };
	DirectX::XMFLOAT3 scale = { 1.0f, 1.0f, 1.0f };
};
